---
kind: method
id: M:Autodesk.Revit.DB.Analysis.AnalysisDisplayStyle.HasColoredSurfaceSettings
source: html/21362785-8b7e-9246-4c00-646271bd2207.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayStyle.HasColoredSurfaceSettings Method

If true style has colored surface settings.

## Syntax (C#)
```csharp
public bool HasColoredSurfaceSettings()
```